.emacs.d/init.org
#+title: My Emacs Config
#+date: 2020-09-07
#+options: author:nil
#+hugo_tags: emacs config

* Early Init
Emacs 27から =early-init.el= が追加された。
正直、速度的な効果は感じられないが、せっかくなので追加している。

** ヘッダ
#+begin_src emacs-lisp :tangle early-init.el
 ;;; early-init.el --- My early-init script -*- coding: utf-8 ; lexical-binding: t -*-
 ;; Author: grugrut <grugruglut+github@gmail.com>
 ;; URL:
 ;; Version: 1.00

 ;; This program is free software: you can redistribute it and/or modify
 ;; it under the terms of the GNU General Public License as published by
 ;; the Free Software Foundation, either version 3 of the License, or
 ;; (at your option) any later version.

 ;; This program is distributed in the hope that it will be useful,
 ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
 ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 ;; GNU General Public License for more details.

 ;; You should have received a copy of the GNU General Public License
 ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

 ;;; Commentary:

 ;;; Code:

#+end_src

** init処理中に問題があれば気付けるように
エラーがおきたときに、ログだけだと問題がどこにあるのかデバッグが大変なので、
ちゃんとわかるようにしている。
#+begin_src emacs-lisp :tangle early-init.el
 (setq debug-on-error t)
#+end_src

** init.orgだけ編集してたら警告
init.elを直接編集するのではなく、init.org経由で管理するようにしてみたが、
ついorg編集完了後にinit.elに反映するのを忘れがちになってしまう。

そのため、起動時にチェックしてinit.orgの方が新しかったら警告する。
本来は、保存時に自動でこの辺やってくれたほうがよい気はする。
#+begin_src emacs-lisp :tangle early-init.el
  (let ((my-init-org (concat user-emacs-directory "init.org"))
        (my-init-el (concat user-emacs-directory "init.el"))
        (my-early-init-el (concat user-emacs-directory "early-init.el")))
    (when (or (file-newer-than-file-p my-init-org my-init-el)
              (file-newer-than-file-p my-init-org my-early-init-el))
      (message "WARN: init.el is old.\n")))
#+end_src
** GUIの見た目設定
ツールバーは使わないので消している。
メニューバーはときどき使うので残している。

Emacs26から登場したネイティブの行番号表示は、ddskkと相性が悪く
入力中に行がガタガタとずれてつらいので抑制している。

https://www.grugrut.net/posts/201910202227/

#+begin_src emacs-lisp :tangle early-init.el
  ;; ツールバーを表示しない
  (tool-bar-mode 0)

  ;; スクロールバーを表示しない
  (set-scroll-bar-mode nil)

  ;; 行番号を表示
  (line-number-mode +1)
  (column-number-mode +1)

  ;; 行番号表示(Emacs26以降)
  (global-display-line-numbers-mode t)
  (custom-set-variables '(display-line-numbers-width-start t))

  ;; native-compのワーニング抑制
  (custom-set-variables '(warning-suppress-types '((comp))))
#+end_src

** フレームサイズ
#+begin_src emacs-lisp :tangle early-init.el
 (setq default-frame-alist
       (append '((width                . 140)  ; フレーム幅
                 (height               . 40 ) ; フレーム高
                 (left                 . 170 ) ; 配置左位置
                 (top                  . 30 ) ; 配置上位置
                 (line-spacing         . 0  ) ; 文字間隔
                 (left-fringe          . 12 ) ; 左フリンジ幅
                 (right-fringe         . 12 ) ; 右フリンジ幅
                 (menu-bar-lines       . 1  ) ; メニューバー
                 (cursor-type          . box) ; カーソル種別
                 (alpha                . 100) ; 透明度
                 )
               default-frame-alist))
 (setq initial-frame-alist default-frame-alist)

 (modify-frame-parameters nil '((sticky . t) (width . 100) (height . 40))) ; Xを使う場合の高速化設定らしい
#+end_src

** カスタムファイル
=custom-set-variables= を利用すると、 =custom-file= に設定内容が書かれる。
しかしこれをロードしてしまうと、 =custom-file= に残ったゴミのせいで、=init.el= を修正したつもりなのに
昔の設定で動いてしまうことがある。

しかし、定義はしておかないと起動時に文句を言われてしまうので設定だけして読まずに捨ててる。

#+begin_src emacs-lisp :tangle early-init.el
 (custom-set-variables '(custom-file (expand-file-name "custom.el" user-emacs-directory)))
#+end_src

** フッタ
#+begin_src emacs-lisp :tangle early-init.el
 ;;; early-init.el ends here

 #+end_src

* init.el本体
** ヘッダ
 #+begin_src emacs-lisp :tangle yes
 ;;; init.el --- My init script -*- coding: utf-8 ; lexical-binding: t -*-

 ;; Author: grugrut
 ;; URL: https://github.com/grugrut/.emacs.d/init.el

 ;;; Commentary:

 ;;; Code:

#+end_src

** パッケージ読込
*** leaf.el
以前は =use-package= + =straight.el= を使っていたが、
 =straight.el= は、会社のプロキシ環境下での相性が悪く、
パッケージ取得に失敗してしまうことが多くあきらめた。

 現在は、 =leaf.el= を使っていて、
 一部 =packages= だけでは対応しきれないものについては、 =el-get= を使っている。

 #+begin_src emacs-lisp :tangle yes
  ;; leaf.el

  (prog1 "leaf"
    (prog1 "install leaf"
      (custom-set-variables
       '(package-archives '(("org"   . "https://orgmode.org/elpa/")
                            ("melpa" . "https://melpa.org/packages/")
                            ("gnu"   . "https://elpa.gnu.org/packages/"))))
      (package-initialize)
      (unless (package-installed-p 'leaf)
        (package-refresh-contents)
        (package-install 'leaf)))

    (leaf leaf-keywords
      :ensure t
      :config
      ;; optional packages if you want to use :hydra, :el-get,,,
      (leaf hydra :ensure t)
      (leaf el-get :ensure t
        :custom ((el-get-git-shallow-clone . t)))

      ;; initialize leaf-keywords.el
      (leaf-keywords-init)))

 #+end_src

表示するマイナーモードはできるだけ小さくしたいので、 =diminish= で抑制している。
今のところは制御できているが、 =diminish= はモードの実装によっては適用するのが難しく、
blackoutの方が簡単らしく、ちょっと気にはなっている。

 #+begin_src emacs-lisp :tangle yes
  (leaf leaf-util-packages
    :config
    (leaf diminish :ensure t :require t)
    (leaf bind-key)
    (leaf key-chord
      :el-get (key-chord
               :url "https://raw.githubusercontent.com/zk-phi/key-chord/master/key-chord.el")
      :require t
      :config (key-chord-mode 1)))
 #+end_src

*** Paradox
 =package.el= のラッパーとして、 paradoxを使っている。
 表示内容を拡張してわかりやすくしてくれたり、アップデート時に並列で処理をしてくれたりと便利。
 #+begin_src emacs-lisp :tangle yes
  (leaf paradox
    :ensure t
    :config
    (paradox-enable))
 #+end_src

** early-init.elの読みこみ
Emacs27がリリースされる前に、一部の環境では26.3を利用していたので、
early-init.elに逃した設定を読みこむために入れていた。

今は、Windowsの27バイナリもリリースされたので不要かも。
#+begin_src emacs-lisp :tangle yes
 (leaf early-init
   :doc "emacs26以前はearly-init.elが使えないので手動で読みこむ"
   :emacs< "27.1"
   :config
   (load (concat user-emacs-directory "early-init.el"))
   )
#+end_src

** ライブラリ群
#+begin_src emacs-lisp :tangle yes
 (leaf libraries
   :doc "ライブラリ群"
   :config
   (leaf cl-lib
     :leaf-defer t)
   (leaf dash
     :ensure t
     :leaf-defer t)
   (leaf posframe
     :ensure t
     :preface
     (defun my-posframe-arghandler (buffer-or-name arg-name value)
       (let ((info '(:internal-border-width 1 :internal-border-color "gray80")))
         (or (plist-get info arg-name) value)))
     :custom
     (posframe-arghandler . #'my-posframe-arghandler)
     :leaf-defer t)
   (leaf smartrep
     :ensure t
     :leaf-defer t))
#+end_src 

** 全体設定
*** メモリ管理
**** gcmh
 アイドル状態のときに、ガベージコレクトしてくれるらしい。

 https://github.com/emacsmirror/gcmh
  #+begin_src emacs-lisp :tangle yes
   (leaf gcmh
     :ensure t
     :diminish gcmh
     :custom
     (gcmh-verbose . t)
     :config
     (gcmh-mode 1))
  #+end_src
**** GC後に利用メモリサイズを出力する

     #+begin_src emacs-lisp :tangle yes
              (defun grugrut/gc-debug-function (str)
                (let ((sum 0))
                  (dolist (x str)
                    (setq sum (+ sum (* (cl-second x) (cl-third x)))))
                  (message "Used Memory: %d MB" (/ sum (* 1024 1024)))))
              (advice-add 'garbage-collect :filter-return #'grugrut/gc-debug-function)
     #+end_src
     

*** popwin
 #+begin_src emacs-lisp :tangle yes
   (leaf popwin
     :ensure t
     :custom
     (popwin:popup-window-position . 'bottom))
 #+end_src
*** 変数設定
 #+begin_src emacs-lisp :tangle yes
   (leaf general-setting
     :config
     (prefer-coding-system 'utf-8-unix)
     (defalias 'yes-or-no-p 'y-or-n-p) ; yes-or-no-pをy/nで選択できるようにする
     ;; recentf
     (defvar recentf-max-saved-items 1000)
     (defvar recentf-auto-cleanup 'never)
     (global-set-key [mouse-2] 'mouse-yank-at-click)
     (delete-selection-mode t) ; リージョン選択時にリージョンまるごと削除
     (leaf exec-path-from-shell
       :ensure t
       :config
       (exec-path-from-shell-initialize))
     (leaf web-browser-for-wsl
       :doc "ブラウザ設定 WSL限定"
       :config
       (let ((cmd-exe "/mnt/c/Windows/System32/cmd.exe")
             (cmd-args '("/c" "start")))
         (when (file-exists-p cmd-exe)
           (setq browse-url-browser-function 'browse-url-generic
                 browse-url-generic-program cmd-exe
                 browse-url-generic-args cmd-args))))
     ;; 対応する括弧を光らせる
     (show-paren-mode t)
     (defvar show-paren-style 'mixed)
     ;; カーソルを点滅させない
     (blink-cursor-mode 0)
     ;; 単語での折り返し
     (leaf visual-line-mode
       :require simple
       :config
       (global-visual-line-mode t)
       (diminish 'visual-line-mode nil))

     ;; マウスを避けさせる
     (mouse-avoidance-mode 'jump)
     (setq frame-title-format "%f")
     :setq
     `((large-file-warning-threshold	         . ,(* 25 1024 1024))
       (read-file-name-completion-ignore-case . t)
       (use-dialog-box                        . nil)
       (history-length                        . 500)
       (history-delete-duplicates             . t)
       (line-move-visual                      . nil)
       (mouse-drag-copy-region                . t)
       (backup-inhibited                      . t)
       (inhibit-startup-message               . t)
       (require-final-newline                 . t)
       (next-line-add-newlines                . nil)
       (frame-title-format                    . "%f")
       (truncate-lines                        . t)
       (read-process-output-max               . ,(* 1024 1024)))
     :setq-default
     (indent-tabs-mode . nil) ; タブはスペースで
     (tab-width        . 2)
     (require-final-newline . t)
     )
 #+end_src
*** uniquify
 #+begin_src emacs-lisp :tangle yes
   ;; 同一バッファ名にディレクトリ付与
   (leaf uniquify
     :custom
     (uniquify-buffer-name-style . 'post-forward-angle-brackets)
     (uniquify-ignore-buffers-re . "*[^*]+*"))
 #+end_src
** 外観設定
