.emacs.d/init.el
;;; init.el --- My init script -*- coding: utf-8 ; lexical-binding: t -*-

;; Author: grugrut
;; URL: https://github.com/grugrut/.emacs.d/init.el

;;; Commentary:

;;; Code:

;; leaf.el

(prog1 "leaf"
  (prog1 "install leaf"
    (custom-set-variables
     '(package-archives '(("org"   . "https://orgmode.org/elpa/")
                          ("melpa" . "https://melpa.org/packages/")
                          ("gnu"   . "https://elpa.gnu.org/packages/"))))
    (package-initialize)
    (unless (package-installed-p 'leaf)
      (package-refresh-contents)
      (package-install 'leaf)))

  (leaf leaf-keywords
    :ensure t
    :config
    ;; optional packages if you want to use :hydra, :el-get,,,
    (leaf hydra :ensure t)
    (leaf el-get :ensure t
      :custom ((el-get-git-shallow-clone . t)))

    ;; initialize leaf-keywords.el
    (leaf-keywords-init)))

(leaf leaf-util-packages
  :config
  (leaf diminish :ensure t :require t)
  (leaf bind-key)
  (leaf key-chord
    :el-get (key-chord
             :url "https://raw.githubusercontent.com/zk-phi/key-chord/master/key-chord.el")
    :require t
    :config (key-chord-mode 1)))

(leaf paradox
  :ensure t
  :config
  (paradox-enable))

(leaf early-init
  :doc "emacs26以前はearly-init.elが使えないので手動で読みこむ"
  :emacs< "27.1"
  :config
  (load (concat user-emacs-directory "early-init.el"))
  )

(leaf libraries
  :doc "ライブラリ群"
  :config
  (leaf cl-lib
    :leaf-defer t)
  (leaf dash
    :ensure t
    :leaf-defer t)
  (leaf posframe
    :ensure t
    :preface
    (defun my-posframe-arghandler (buffer-or-name arg-name value)
      (let ((info '(:internal-border-width 1 :internal-border-color "gray80")))
        (or (plist-get info arg-name) value)))
    :custom
    (posframe-arghandler . #'my-posframe-arghandler)
    :leaf-defer t)
  (leaf smartrep
    :ensure t
    :leaf-defer t))

(leaf gcmh
  :ensure t
  :diminish gcmh
  :custom
  (gcmh-verbose . t)
  :config
  (gcmh-mode 1))

(defun grugrut/gc-debug-function (str)
  (let ((sum 0))
    (dolist (x str)
      (setq sum (+ sum (* (cl-second x) (cl-third x)))))
    (message "Used Memory: %d MB" (/ sum (* 1024 1024)))))
(advice-add 'garbage-collect :filter-return #'grugrut/gc-debug-function)

(leaf popwin
  :ensure t
  :custom
  (popwin:popup-window-position . 'bottom))

(leaf general-setting
  :config
  (prefer-coding-system 'utf-8-unix)
  (defalias 'yes-or-no-p 'y-or-n-p) ; yes-or-no-pをy/nで選択できるようにする
  ;; recentf
  (defvar recentf-max-saved-items 1000)
  (defvar recentf-auto-cleanup 'never)
  (global-set-key [mouse-2] 'mouse-yank-at-click)
  (delete-selection-mode t) ; リージョン選択時にリージョンまるごと削除
  (leaf exec-path-from-shell
    :ensure t
    :config
    (exec-path-from-shell-initialize))
  (leaf web-browser-for-wsl
    :doc "ブラウザ設定 WSL限定"
    :config
    (let ((cmd-exe "/mnt/c/Windows/System32/cmd.exe")
          (cmd-args '("/c" "start")))
      (when (file-exists-p cmd-exe)
        (setq browse-url-browser-function 'browse-url-generic
              browse-url-generic-program cmd-exe
              browse-url-generic-args cmd-args))))
  ;; 対応する括弧を光らせる
  (show-paren-mode t)
  (defvar show-paren-style 'mixed)
  ;; カーソルを点滅させない
  (blink-cursor-mode 0)
  ;; 単語での折り返し
  (leaf visual-line-mode
    :require simple
    :config
    (global-visual-line-mode t)
    (diminish 'visual-line-mode nil))

  ;; マウスを避けさせる
  (mouse-avoidance-mode 'jump)
  (setq frame-title-format "%f")
  :setq
  `((large-file-warning-threshold	         . ,(* 25 1024 1024))
    (read-file-name-completion-ignore-case . t)
    (use-dialog-box                        . nil)
    (history-length                        . 500)
    (history-delete-duplicates             . t)
    (line-move-visual                      . nil)
    (mouse-drag-copy-region                . t)
    (backup-inhibited                      . t)
    (inhibit-startup-message               . t)
    (require-final-newline                 . t)
    (next-line-add-newlines                . nil)
    (frame-title-format                    . "%f")
    (truncate-lines                        . t)
    (read-process-output-max               . ,(* 1024 1024)))
  :setq-default
  (indent-tabs-mode . nil) ; タブはスペースで
  (tab-width        . 2)
  )

;; 同一バッファ名にディレクトリ付与
(leaf uniquify
  :custom
  (uniquify-buffer-name-style . 'post-forward-angle-brackets)
  (uniquify-ignore-buffers-re . "*[^*]+*"))

(leaf font
  :config
  ;; 絵文字
