.emacs.d/init.org
*** フォント設定
 基本的にはCicaを使っているが、Cicaが独自の絵文字領域をもっていて、
 unicodeの範囲全体を指定してしまうと、All-the-iconsで入れた絵文字が使われない問題があったので、
 範囲をしぼっている。
 不都合があれば、都度追加していく必要がある。

 #+begin_src emacs-lisp :tangle yes
   (leaf font
     :config
     ;; 絵文字
     ;; (unicode-fonts-setup) ; 最初に本コマンドの実行が必要
     ;; (all-the-icons-install-fonts)
     (leaf unicode-fonts
       :ensure t)
     (leaf all-the-icons
       :ensure t)
     ;; フォント設定
     ;;
     ;; abcdefghik
     ;; 0123456789
     ;; あいうえお
     (let* ((family "Cica")
            (fontspec (font-spec :family family :weight 'normal)))
       (set-face-attribute 'default nil :family family :height 120)
       (set-fontset-font nil 'ascii fontspec nil 'append)
       (set-fontset-font nil 'japanese-jisx0208 fontspec nil 'append))
     (add-to-list 'face-font-rescale-alist '(".*icons.*" . 0.9))
     (add-to-list 'face-font-rescale-alist '(".*FontAwesome.*" . 0.9))
     (leaf text-scale
       :hydra (hydra-zoom ()
                          "Zoom"
                          ("g" text-scale-increase "in")
                          ("l" text-scale-decrease "out")
                          ("r" (text-scale-set 0) "reset")
                          ("0" (text-scale-set 0) :bind nil :exit t))
       :bind ("<f2>" . hydra-zoom/body)))
 #+end_src

*** テーマ設定
 #+begin_src emacs-lisp :tangle yes
   (leaf doom-themes
     :ensure t
     :config
     (load-theme 'doom-vibrant t)
     (doom-themes-visual-bell-config)
     (doom-themes-neotree-config)
     (doom-themes-org-config))
 #+end_src

*** モードライン
**** minions
モードラインにマイナーモードが並んで圧迫されるのが嫌だったので、
一時期は =minions= を使っていた。
=ddskk= の状態表示もまとめられてしまって使い勝手が良くなかったので、
今は無効化して、不要なマイナーモードは =diminish= で消すようにしている。
  #+begin_src emacs-lisp :tangle yes
    (leaf minions
      :ensure t
      :disabled t
      :config
      (minions-mode t))
  #+end_src

**** eldoc
  #+begin_src emacs-lisp :tangle yes
    (leaf eldoc
      :diminish eldoc-mode)
  #+end_src

**** doom-modeline
  #+begin_src emacs-lisp :tangle yes
    (leaf doom-modeline
      :ensure t
      :require t
      :hook (after-init-hook . doom-modeline-mode)
      :custom
      (doom-modeline-buffer-file-name-style . 'truncate-with-project)
      (doom-modeline-bar-width . 3)
      (doom-modeline-height . 25)
      (doom-modeline-major-mode-color-icon . t)
      (doom-modeline-minor-modes . t)
      (doom-modeline-github . nil)
      (doom-modeline-mu4e . nil)
      (doom-modeline-irc . nil))
  #+end_src

*** beacon
バッファを移動したときに、カーソル位置を一瞬だけ強調してわかりやすくする。
 #+begin_src emacs-lisp :tangle yes
   (leaf beacon
     :ensure t
     :diminish beacon-mode
     :require t
     :config
     (beacon-mode 1))
 #+end_src

*** volatile-highlights
ヤンクした場合などに編集箇所を強調表示してわかりやすくする。
#+begin_src emacs-lisp :tangle yes
  ;; 操作した際に、操作箇所を強調表示する
  (leaf volatile-highlights
    :ensure t
    :require t
    :diminish volatile-highlights-mode
    :config
    (volatile-highlights-mode t))
#+end_src
*** インデント表示
 #+begin_src emacs-lisp :tangle yes
   (leaf highlight-indent-guides
     :ensure t
     :require t
     :diminish highlight-indent-guides-mode
     :custom
     (highlight-indent-guides-method . 'character)
     (highlight-indent-guides-auto-character-face-perc . 20)
     (highlight-indent-guides-character . ?\|)
     :hook
     (prog-mode-hook . highlight-indent-guides-mode))
 #+end_src
*** ファイル最終行以降をわかりやすく
vim風に、最終行以降に~を表示する。
これはfringeに表示するので、行番号表示とずれてしまうのが難点。
 #+begin_src emacs-lisp :tangle yes
   ;; vi風に空行に~を表示する
   (leaf vi-tilde-fringe
     :ensure t
     :require t
     :leaf-defer t
     :commands vi-tilde-fringe-mode
     :diminish vi-tilde-fringe-mode
     :config
     (global-vi-tilde-fringe-mode))
 #+end_src
*** minimap
 #+begin_src emacs-lisp :tangle yes
   (leaf minimap
     :ensure t
     :leaf-defer t
     :config
     (setq minimap-window-location 'right
           minimap-update-delay 0.2
           minimap-minimum-width 20)
     :bind ("s-m" . minimap-mode))
 #+end_src
*** rainbow-mode
CSSなどのカラーコードを実際の色で表示してくれる。
 #+begin_src emacs-lisp :tangle yes
   (leaf rainbow-mode
     :ensure t
     :leaf-defer t
     :hook
     (web-mode-hook . rainbow-mode))
 #+end_src

** カーソル移動
*** backward-forward
~C-Left~ と ~C-Right~ でマークを行き来できる。あまり使いこなせてない。
 #+begin_src emacs-lisp :tangle yes
   (leaf backward-forward
     :ensure t
     :config
     (backward-forward-mode 1))
 #+end_src
*** bookmark
 #+begin_src emacs-lisp :tangle yes
   (leaf bm
     :ensure t
     :leaf-defer t
     :commands (bm-toggle
                bm-next
                bm-previous)
     :bind
     (("C-S-SPC" . bm-toggle)
      ("C-}" . bm-previous)
      ("C-]" . bm-next)))
 #+end_src

*** avy
vimの ~f~ に相当する。zap-to-char( ~M-z~ )でもavyインタフェースで削除位置を指定できるようにしている。
 #+begin_src emacs-lisp :tangle yes
   (leaf avy
     :ensure t
     :bind
     (("C-:" . avy-goto-char-timer)
      ("C-*" . avy-resume)
      ("M-g M-g" . avy-goto-line))
     :config
     (leaf avy-zap
       :ensure t
       :bind
       ([remap zap-to-char] . avy-zap-to-char)))
 #+end_src
** ace-window
#+begin_src emacs-lisp :tangle yes

  (leaf ace-window
    :ensure t
    :bind
    (("C-x o" . ace-window))
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :custom-face
    (aw-leading-char-face . '((t (:height 2.0)))))
#+end_src

** ddskk
#+begin_src emacs-lisp :tangle yes
  (leaf ddskk
    :ensure t
    :bind
    (("C-x C-j" . skk-mode)
     ("C-x j"   . skk-mode))
    :init
    (defvar dired-bind-jump nil)  ; dired-xがC-xC-jを奪うので対処しておく
    :custom
    (skk-use-azik                     . t)      ; AZIKを使用する
    (skk-azik-keyboard-type           . 'jp106)
    (skk-tut-file                     . nil)
    (skk-server-host                  . "localhost")
    (skk-server-portnum               . 1178)   ;
    (skk-egg-like-newline             . t)      ; 変換時にリターンでは改行しない
    (skk-japanese-message-and-error   . t)      ; メッセージを日本語にする
    (skk-auto-insert-paren            . t)      ; 対応する括弧を自動挿入
    (skk-check-okurigana-on-touroku   . t)      ;
    (skk-show-annotation              . t)      ; アノテーションを表示
    (skk-anotation-show-wikipedia-url . t)      ;
    (skk-show-tooltip                 . nil)    ; 変換候補をインライン表示しない
    (skk-isearch-start-mode           . 'latin) ; isearch時にSKKをオフ
    (skk-henkan-okuri-strictly        . nil)    ; 送り仮名を考慮した変換候補
    (skk-process-okuri-early          . nil)
    (skk-status-indicator             . 'minor-mode)
    :hook
    (skk-azik-load-hook . my/skk-azik-disable-tU)
    :preface
    (defun my/skk-azik-disable-tU ()
      "ddskkのazikモードが`tU'を`っ'として扱うのを抑制する."
      (setq skk-rule-tree (skk-compile-rule-list
                           skk-rom-kana-base-rule-list
                           (skk-del-alist "tU" skk-rom-kana-rule-list)))))
#+end_src
** 操作
#+begin_src emacs-lisp :tangle yes
  (leaf highlight-symbol
    :ensure t
    :leaf-defer t
    :bind
    (("C-." . highlight-symbol-at-point)))
#+end_src
#+begin_src emacs-lisp :tangle yes

  (leaf expand-region
    :ensure t
    :leaf-defer t
    :bind
    (("C-," . er/expand-region)
     ("C-M-," . er/contract-region)))
#+end_src
#+begin_src emacs-lisp :tangle yes

  (leaf multiple-cursors
    :ensure t
    :after smartrep
    :config
    (global-unset-key (kbd "C-t"))
    (smartrep-define-key global-map "C-t"
      '(("C-t" . 'mc/mark-next-like-this)
        ("n"   . 'mc/mark-next-like-this)
        ("p"   . 'mc/mark-previous-like-this)
        ("m"   . 'mc/mark-more-like-this-extended)
        ("u"   . 'mc/unmark-next-like-this)
        ("U"   . 'mc/unmark-previous-like-this)
        ("s"   . 'mc/skip-to-next-like-this)
        ("S"   . 'mc/skip-to-previous-like-this)
        ("*"   . 'mc/mark-all-like-this)
        ("a"   . 'mc/mark-all-like-this)
        ("d"   . 'mc/mark-all-like-this-dwim)
        ("i"   . 'mc/insert-numbers)
        ("l"   . 'mc/insert-letters)
        ("o"   . 'mc/sort-regions)
        ("O"   . 'mc/reverse-regions))))
#+end_src
#+begin_src emacs-lisp :tangle yes

  (leaf smooth-scroll
    :ensure t
    :require t
    :diminish smooth-scroll-mode
    :config
    (smooth-scroll-mode t))
#+end_src
#+begin_src emacs-lisp :tangle yes

  (leaf auto-revert
    :diminish auto-revert-mode
    :config
    (global-auto-revert-mode t))
#+end_src
