.emacs.d/init.el

(leaf search-functions
  :setq
  (case-fold-search . nil) ; 大文字・小文字を区別しないでサーチ（有効：t、無効：nil）
  (isearch-allow-scroll . nil) ; インクリメント検索時に縦スクロールを有効化（有効：t、無効：nil）
  :config
  (leaf google-this
    :ensure t
    :leaf-defer t
    :bind (("M-s g" . google-this-noconfirm)))

  (leaf anzu
    :ensure t
    :bind
    (("M-%" . anzu-query-replace))
    :config
    (global-anzu-mode +1)
    )

  (leaf migemo
    :ensure t
    :require t
    :custom
    (migemo-command . "cmigemo")
    (migemo-options . '("-q" "--emacs"))
    (migemo-dictionary . "/usr/share/cmigemo/utf-8/migemo-dict")
    (migemo-user-dictionary . nil)
    (migemo-regex-dictionary . nil)
    (migemo-coding-system . 'utf-8-unix)
    :config
    (migemo-init))

  (leaf ripgrep
    :ensure t
    :leaf-defer t
    :bind (("M-s r" . ripgrep-regexp))
    :config
    (setq ripgrep-arguments '("-S")))
  ;; minibufferのアクティブ時、IMEを無効化
  (add-hook 'minibuffer-setup-hook
            (lambda ()
              (deactivate-input-method)))
  )

(setq comment-style 'extra-line)

(leaf imenu-list
  :ensure t
  :bind (("s-i" . imenu-list-smart-toggle))
  :custom
  (imenu-list-focus-after-activation . t)
  :config
  (leaf leaf-tree
    :doc "leafのブロックを意識して表示"
    :diminish leaf-tree
    :ensure t))

(leaf yafolding
  :ensure t
  :leaf-defer t
  :hook
  (prog-mode-hook . yafolding-mode))

(leaf projectile
  :ensure t t
  :init
  :config
  (setq projectile-mode-line-prefix " Prj")
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map))

(leaf quickrun
  :ensure t
  :leaf-defer t
  :after bind-key
  :commands (quickrun)
  :init
  (bind-key "C-c C-c" 'quickrun prog-mode-map))

(leaf neotree
  :ensure t
  :bind ("H-t" . neotree-toggle))

(leaf flycheck
  :ensure t
  :leaf-defer t
  :diminish flycheck-mode
  :hook (prog-mode-hook . flycheck-mode))

(leaf lsp-mode
  :ensure t
  :require t
  :commands lsp
  :hook
  (go-mode-hook . lsp)
  (web-mode-hook . lsp)
  (elixir-mode-hook . lsp)
  (typescript-mode-hook . lsp)
  :config
  (leaf lsp-ui
    :ensure t
    :require t
    :hook
    (lsp-mode-hook . lsp-ui-mode)
    :custom
    (lsp-ui-sideline-enable . nil)
    (lsp-prefer-flymake . nil)
    (lsp-print-performance . t)
    :config
    (define-key lsp-ui-mode-map [remap xref-find-definitions] 'lsp-ui-peek-find-definitions)
    (define-key lsp-ui-mode-map [remap xref-find-references] 'lsp-ui-peek-find-references)
    (define-key lsp-ui-mode-map (kbd "C-c i") 'lsp-ui-imenu)
    (define-key lsp-ui-mode-map (kbd "s-l") 'hydra-lsp/body)
    (setq lsp-ui-doc-position 'bottom)
    :hydra (hydra-lsp (:exit t :hint nil)
                      "
 Buffer^^               Server^^                   Symbol
-------------------------------------------------------------------------------------
 [_f_] format           [_M-r_] restart            [_d_] declaration  [_i_] implementation  [_o_] documentation
 [_m_] imenu            [_S_]   shutdown           [_D_] definition   [_t_] type            [_r_] rename
 [_x_] execute action   [_M-s_] describe session   [_R_] references   [_s_] signature"
                      ("d" lsp-find-declaration)
                      ("D" lsp-ui-peek-find-definitions)
                      ("R" lsp-ui-peek-find-references)
                      ("i" lsp-ui-peek-find-implementation)
                      ("t" lsp-find-type-definition)
                      ("s" lsp-signature-help)
                      ("o" lsp-describe-thing-at-point)
                      ("r" lsp-rename)

                      ("f" lsp-format-buffer)
                      ("m" lsp-ui-imenu)
                      ("x" lsp-execute-code-action)

                      ("M-s" lsp-describe-session)
                      ("M-r" lsp-restart-workspace)
                      ("S" lsp-shutdown-workspace))))

(leaf golang
  :config
  (leaf go-mode
    :ensure t
    :leaf-defer t
    :commands (gofmt-before-save)
    :init
    (add-hook 'before-save-hook 'gofmt-before-save)
    (setq tab-width 4))

  (leaf protobuf-mode
    :ensure t)

  (leaf go-impl
    :ensure t
    :leaf-defer t
    :commands go-impl))

(leaf web-mode
  :ensure t
  :after flycheck
  :defun flycheck-add-mode
  :mode (("\\.html?\\'" . web-mode)
         ("\\.scss\\'" . web-mode)
         ("\\.css\\'" . web-mode)
         ("\\.twig\\'" . web-mode)
         ("\\.vue\\'" . web-mode)
         ("\\.js\\'" . web-mode))
  :config
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  (setq web-mode-markup-indent-offset 2
        web-mode-css-indent-offset 2
        web-mode-code-indent-offset 2
        web-mode-comment-style 2
        web-mode-style-padding 1
        web-mode-script-padding 1)
  )

(leaf emmet-mode
  :ensure t
  :leaf-defer t
  :commands (emmet-mode)
  :hook
  (web-mode-hook . emmet-mode))

(leaf typescript-mode
  :ensure t)

(leaf groovy-mode
  :ensure t
  :leaf-defer t
  :mode (("Jenkinsfile" . groovy-mode)))

(leaf rust-mode
  :ensure t
  :leaf-defer t
  :config
  (setq-default rust-format-on-save t))

(leaf racer
  :ensure t
  :leaf-defer t
  :hook
  (rust-mode-hook . racer-mode)
  (racer-mode-hook . eldoc-mode))

(leaf flycheck-rust
  :ensure t
  :leaf-defer t
  :after racer
  :init
  (add-hook 'rust-mode-hook (lambda ()
                              (racer-mode)
                              (flycheck-rust-setup))))

(leaf alchemist
  :ensure t
  :leaf-defer t
  :config
  (setq alchemist-hooks-compile-on-save t))

(defun my/elixir-do-end-close-action (id action context)
  (when (eq action 'insert)
    (newline-and-indent)
    (forward-line -1)
    (indent-according-to-mode)))

(leaf elixir-mode
  :ensure t
  :after smartparens
  :config
  ;; Create a buffer-local hook to run elixir-format on save, only when we enable elixir-mode.
  (add-hook 'elixir-mode-hook
            (lambda () (add-hook 'before-save-hook 'elixir-format nil t)))
  (sp-with-modes '(elixir-mode)
    (sp-local-pair "->" "end"
                   :when '(("RET"))
                   :post-handlers '(:add my/elixir-do-end-close-action)
                   :actions '(insert)))
  (sp-with-modes '(elixir-mode)
    (sp-local-pair "do" "end"
                   :when '(("SPC" "RET"))
                   :post-handlers '(:add my/elixir-do-end-close-action)
                   :actions '(insert)))
  )

(leaf flycheck-elixir
  :ensure t
  :leaf-defer t
  :after elixir-mode)

(leaf elixir-yasnippets
  :ensure t
  :leaf-defer t
  :after elixir-mode)

(leaf python-mode
  :ensure t
  :leaf-defer t
  :custom ((python-shell-interpreter . "ipython"))
  :mode (("\\.py\\'" . python-mode))
  )

(leaf yaml-mode
  :ensure t
  :leaf-defer t
  :mode ("\\.yaml\\'" . yaml-mode))

(leaf markdown
  :config
