.emacs.d/init.el
  (leaf markdown-mode
    :ensure t
    :leaf-defer t
    :mode ("\\.md\\'" . gfm-mode)
    :custom
    (markdown-command . "github-markup")
    (markdown-command-needs-filename . t))
  (leaf markdown-preview-mode
    :ensure t))

(leaf dockerfile-mode
  :ensure t)

(leaf plantuml-mode
  :ensure t
  :mode ("\\.puml\\'" . plantuml-mode)
  :custom
  (plantuml-default-exec-mode . 'jar)
  (plantuml-jar-path . "~/bin/plantuml.jar")
  )

(leaf smartparens
  :ensure t
  :require smartparens-config
  :diminish smartparens-mode
  :hook
  (prog-mode-hook . turn-on-smartparens-mode)
  :config
  (show-smartparens-global-mode t))

(leaf rainbow-delimiters
  :ensure t
  :leaf-defer t
  :hook
  (prog-mode-hook . rainbow-delimiters-mode))

(leaf fontawesome
  :ensure t)

(leaf codic
  :ensure t
  :leaf-defer t)

(leaf code-completion
  :config
  (leaf company
    :ensure t
    :require t
    :diminish company-mode
    :defun (global-company-mode
            company-abort
            company-complete-number)
    :config
    (global-company-mode)
    (setq company-idle-delay 0.3
          company-minimum-prefix-length 1
          company-begin-commands '(self-insert-command)
          company-selection-wrap-around t
          company-show-numbers t))

  (leaf company-box
    :ensure t
    :require t
    :diminish company-box-mode
    :hook (company-mode-hook . company-box-mode)
    :after all-the-icons
    :init
    (setq company-box-icons-elisp
          (list
           (concat (all-the-icons-material "functions") " ")
           (concat (all-the-icons-material "check_circle") " ")
           (concat (all-the-icons-material "stars") " ")
           (concat (all-the-icons-material "format_paint") " ")))
    (setq company-box-icons-unknown (concat (all-the-icons-material "find_in_page") " "))
    (setq company-box-backends-colors nil)
    (setq company-box-icons-alist 'company-box-icons-all-the-icons))

  (leaf company-posframe
    :ensure t
    :require t
    :diminish company-posframe-mode
    :after company
    :config
    (company-posframe-mode 1))

  (leaf company-tabnine
    :ensure t
    :after company
    :require t
    :config
    (add-to-list 'company-backends #'company-tabnine)))

(leaf yasnippet
  :ensure t
  :diminish yas-minor-mode
  :require t
  :defun yas-global-mode
  :config
  (yas-global-mode 1))

(leaf view
  :require t
  :chord (("fj" . view-mode))
  :bind  (:view-mode-map
          ("j" . next-line)
          ("k" . previous-line)
          ("h" . backward-char)
          ("l" . forward-char))
  :config
  (setq view-read-only t))

(leaf org
  :leaf-defer t
  :bind (("C-c c" . org-capture)
         ("C-c a" . org-agenda)
         (:org-mode-map
          ("C-c C-;" . org-edit-special))
         (:org-src-mode-map
          ("C-c C-;" . org-edit-src-exit)))
  :mode ("\\.org$'" . org-mode)
  ;; :hook  (org-mode . (lambda ()
  ;;                      (set (make-local-variable 'system-time-locale) "C")))
  :config
  (setq org-directory "~/src/github.com/grugrut/PersonalProject/")
  :custom
  ;; TODO状態の設定
  (org-todo-keywords . '((sequence "TODO(t)" "STARTED(s)" "|" "DONE(d)")
                         (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "MEETING")))
  (org-todo-keyword-faces . '(("TODO" :foreground "red" :weight bold)
                              ("STARTED" :foreground "cornflower blue" :weight bold)
                              ("DONE" :foreground "green" :weight bold)
                              ("WAITING" :foreground "orange" :weight bold)
                              ("HOLD" :foreground "magenta" :weight bold)
                              ("CANCELLED" :foreground "green" :weight bold)
                              ("MEETING" :foreground "gren" :weight bold)))
  (org-log-done . 'time)
  (org-clock-persist . t)
  (org-clock-out-when-done . t)
  )
(leaf org-capture
  :leaf-defer t
  :after org
  :commands (org-capture)
  :config
  (defvar grugrut/org-inbox-file (concat org-directory "inbox.org"))
  (defvar grugrut/org-journal-file (concat org-directory "journal.org"))
  (setq org-capture-templates `(
                                ("t" " Tasks" entry (file ,grugrut/org-inbox-file)
                                 "* TODO %? %^G\n:PROPERTIES:\n:DEADLINE: %^{Deadline}T\n:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n")
                                ("e" " Event" entry (file ,grugrut/org-inbox-file)
                                 "* TODO %? %^G\n:PROPERTIES:\n:SCHEDULED: %^{Scheduled}T\n:EFFORT:%^{effort|1:00|0:05|0:15|0:30|2:00|4:00}\n:END:\n")
                                ("j" " Journal" entry (file+olp+datetree ,grugrut/org-journal-file)
                                 "* %<%H:%M> %?")
                                ("b" " blog" entry
                                 (file+headline "~/src/github.com/grugrut/blog/draft/blog.org" ,(format-time-string "%Y"))
                                 "** TODO %?\n:PROPERTIES:\n:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :archives '(\\\"%(format-time-string \"%Y\")\\\" \\\"%(format-time-string \"%Y-%m\")\\\")\n:EXPORT_FILE_NAME: %(format-time-string \"%Y%m%d%H%M\")\n:END:\n\n")
                                )))

(leaf org-superstar
  :ensure t
  :custom
  (org-superstar-headline-bullets-list . '("󿕸" "󿖀" "󿕾" "󿕼" "󿕺" "󿖍"))
  :hook
  (org-mode-hook (lambda () (org-superstar-mode 1)))
  )

(leaf ox-hugo
  :ensure t
  :after ox
  :mode ("\\.org$'" . org-hugo-auto-export-mode))

(leaf ob
  :leaf-defer t
  :after org
  :defun org-babel-do-load-languages
  :config
  (setq org-plantuml-jar-path "~/bin/plantuml.jar")
  (leaf ob-elixir
    :ensure t)
  (leaf ob-go
    :ensure t)
  (leaf ob-rust
    :ensure t)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (elixir . t)
     (go . t)
     (rust . t)
     (plantuml . t))))

(leaf git
  :config
  (leaf magit
    :ensure t
    :bind (("C-x g" . magit-status)))

  ;; gitの差分を表示する
  (leaf git-gutter-fringe
    :ensure t
    :require t
    :custom
    (git-gutter:lighter . "")
    (global-git-gutter-mode . t)
    :bind ("C-x G" . hydra-git-gutter/body)
    :hydra (hydra-git-gutter (:body-pre (git-gutter-mode 1)
                                        :hint nil)
                             "
Git gutter:
  _j_: next hunk     _s_tage hunk   _q_uit
  _k_: previous hunk _r_evert hunk
  _h_: first hunk    _p_opup hunk
  _l_: last hunk     set _R_evision
"
                             ("j" git-gutter:next-hunk)
                             ("k" git-gutter:previous-hunk)
                             ("h" (progn (goto-char (point-min))
                                         (git-gutter:next-hunk 1)))
                             ("l" (progn (goto-char (point-min))
                                         (git-gutter:previous-hunk 1)))
                             ("s" git-gutter:stage-hunk)
                             ("r" git-gutter:revert-hunk)
                             ("p" git-gutter:popup-hunk)
                             ("R" git-gutter:set-start-revision)
                             ("q" nil :color blue))))

(leaf counsel
  :ensure t
  :require t
  :config
