.emacs.d/init.org
** Ivy
ivyに興味がでてきたことと、2020/9/12ごろからHelmの開発が終了しそうになったこととivyに移行中。
#+begin_src emacs-lisp :tangle yes
  (leaf counsel
    :ensure t
    :require t
    :config
    (leaf ivy-hydra :ensure t)
    (ivy-mode 1)
    :custom
    (ivy-use-virtual-buffers . t)
    (ivy-wrap . t)
    (ivy-height . 15)
    (ivy-count-format . "(%d/%d) ")
    (ivy-truncate-lines . nil)
    (ivy-initial-inputs-alist . '())
    (ivy-format-functions-alist . '((t . grugrut/ivy-format-function)))
    (ivy-re-builders-alist . '((t . ivy--regex-ignore-order)))
    :bind
    (("C-z" . nil)
     ("C-;" . ivy-switch-buffer)
     ("C-+" . ivy-resume)
     ("C-x C-f" . counsel-find-file)
     ("M-x" . counsel-M-x)
     ("M-y" . counsel-yank-pop)
     ("C-z w" . swiper-all-thing-at-point)
     ("C-z s" . counsel-git-grep)
     ("C-z d" . counsel-descbinds)
     ("C-z i" . counsel-imenu)
     (ivy-minibuffer-map
      ("C-z" . grugrut/ivy-partial))
     (counsel-find-file-map
      ("C-l" . counsel-up-directory)))
    :preface
    (defun grugrut/ivy-partial ()
      "helmの `helm-execute-persistent-action' に近いものを実現する.
  完全に同じものは無理だったので、ディレクトリなら入る、それ以外はできるだけ補完しバッファは抜けない動作をおこなう."
      (interactive)
      (cond
       ((eq (ivy-state-collection ivy-last) #'read-file-name-internal)
        ;; ファイルオープン
        (let (dir)
          (cond
           ((setq dir (ivy-expand-file-if-directory (ivy-state-current ivy-last)))
            ;; ディレクトリなら入る
            (ivy--cd dir))
           (t
            ;; それ以外ならチラ見アクション
            (ivy-call)))))
       (t
        (ivy-call))))
    (defun grugrut/ivy-format-function (cands)
      "選択の行頭にアイコンを表示する."
      (ivy--format-function-generic
       (lambda (str)
         (concat (all-the-icons-faicon "usb") " " (ivy--add-face str 'ivy-current-match)))
       (lambda (str)
         (concat "    " str))
       cands
       "\n"))
    )
#+end_src

#+begin_src emacs-lisp :tangle yes
  (leaf all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))
#+end_src

#+begin_src emacs-lisp :tangle yes
  (leaf ivy-rich
    :ensure t
    :init (ivy-rich-mode 1))
#+end_src

#+begin_src emacs-lisp :tangle yes
  (leaf ivy-posframe
    :ensure t
    :diminish t
    :custom
    (ivy-posframe-display-functions-alist . '((t . ivy-posframe-display-at-frame-center)))
    :init (ivy-posframe-mode 1))
#+end_src
** 外部連携
#+begin_src emacs-lisp :tangle yes
  (leaf atomic-chrome
    :ensure t
    :config
    (atomic-chrome-start-server))
#+end_src
** ターミナル
vtermが良さそうなので使ってみる

#+begin_src emacs-lisp :tangle yes
  (leaf vterm
    :ensure t)
#+end_src

** Utility
*** markdownへの出力
 #+begin_src emacs-lisp :tangle yes
   (defun grugrut/export-my-init-to-blog ()
     ""
     (interactive)
     (require 'ox-hugo)
     (let ((file "~/src/github.com/grugrut/blog/content/posts/my-emacs-init-el.md"))
       (org-hugo-export-as-md)
       (write-file file t)))

 #+end_src
*** Toast通知

#+begin_src emacs-lisp :tangle yes
  (leaf win-toast
    :el-get (win-toast
             :url "https://raw.githubusercontent.com/grugrut/win-toast/master/win-toast.el"))
#+end_src
** キー設定
#+begin_src emacs-lisp :tangle yes
  (leaf key-settings
    :doc "キー入力設定"
    :config
    (global-unset-key (kbd "C-x C-z"))
    ;; C-hをバックスペース
    (keyboard-translate ?\C-h ?\C-?)
    ;; which-key
    (leaf which-key
      :ensure t
      :require t
      :diminish which-key-mode
      :config
      (which-key-mode)
      (which-key-setup-side-window-right-bottom))
    (leaf which-key-posframe
      :ensure t
      :after '(which-key posframe)
      :config
      (which-key-posframe-mode)
      :custom
      (which-key-posframe-border-width . 2))
    (leaf keyfreq
      :ensure t
      :config
      (keyfreq-mode 1)
      (keyfreq-autosave-mode 1))
    (leaf free-keys
      :doc "利用していないキーマップを教えてくれる"
      :ensure t)
    )
#+end_src
** フッタ
#+begin_src emacs-lisp :tangle yes
  ;;; init.el ends here

 #+end_src
